In [1]:
import numpy as np
import pandas as pd

raw_data = pd.read_excel('./../../Downloads/federalelections2016.xlsx', sheet_name='Table 2. Electoral &  Pop Vote', header=2)

In [2]:
raw_data.columns

Index(['STATE', 'ELECTORAL VOTE', 'ELECTORAL VOTE.1', 'POPULAR VOTE',
       'POPULAR VOTE.1', 'POPULAR VOTE.2', 'POPULAR VOTE.3'],
      dtype='object')

# Cleaning of Federal Election result 
 ### 1. Drop unessessary column

In [3]:
drop_col = ['POPULAR VOTE', 'POPULAR VOTE.1', 'POPULAR VOTE.2', 'POPULAR VOTE.3']
df = raw_data.drop(columns=drop_col)
df.columns

Index(['STATE', 'ELECTORAL VOTE', 'ELECTORAL VOTE.1'], dtype='object')

### 2. Rename column

In [4]:
new_column = ['state', 'trump_points', 'hilarry_points']
df.columns = new_column
df.head()

  state trump_points hilarry_points
0   NaN    Trump (R)    Clinton (D)
1    AL            9            NaN
2    AK            3            NaN
3    AZ           11            NaN
4    AR            6            NaN

### 3. Drop row 0

In [5]:
df = df.drop(df.index[[0, 52, 53,54,55,56,57,58]])
df.head()

  state trump_points hilarry_points
1    AL            9            NaN
2    AK            3            NaN
3    AZ           11            NaN
4    AR            6            NaN
5    CA          NaN             55

### 4. replace NAN with 0

In [6]:
df.trump_points = df.trump_points.fillna(0)
df.hilarry_points = df.hilarry_points.fillna(0)

In [7]:
df.trump_points = df.trump_points.astype('string')
df.hilarry_points = df.hilarry_points.astype('string')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   state           51 non-null     object
 1   trump_points    51 non-null     string
 2   hilarry_points  51 non-null     string
dtypes: object(1), string(2)
memory usage: 1.6+ KB

  state trump_points hilarry_points
1    AL            9              0
2    AK            3              0
3    AZ           11              0
4    AR            6              0
5    CA            0             55

### 5. Remove * from trump and Hillary column

In [8]:
df['trump_points'] = df['trump_points'].map(lambda x: x.rstrip('*'))
df['hilarry_points'] = df['hilarry_points'].map(lambda x: x.rstrip('*'))

### 6. Convert hillary and trump to int

In [9]:
df.trump_points = df.trump_points.astype('int64')
df.hilarry_points = df.hilarry_points.astype('int64')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51 entries, 1 to 51
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   state           51 non-null     object
 1   trump_points    51 non-null     int64
 2   hilarry_points  51 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.6+ KB

### 7. filter to on states in dataset

In [11]:
valid_states = ['NV', 'NC', 'FL', 'OH', 'IA', 'PA', 'CO', 'WI', 'CA', 'AZ', 'NH','MD', 'NY', 'SC', 'VA']
df = df[df.state.isin(valid_states)]
df.state.value_counts()
df.head(20)

   state  trump_points  hilarry_points
3     AZ            11               0
5     CA             0              55
6     CO             0               9
10    FL            29               0
16    IA             6               0
21    MD             0              10
29    NV             0               6
30    NH             0               4
33    NY             0              29
34    NC            15               0
36    OH            18               0
39    PA            20               0
41    SC             9               0
47    VA             0              13
50    WI            10               0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15 entries, 3 to 50
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   state           15 non-null     object
 1   trump_points    15 non-null     int64
 2   hilarry_points  15 non-null     int64
dtypes: int64(2), object(1)
memory usage: 480.0+ bytes

### 8. Trump win or loss column

In [13]:
df[df.trump_points > 0]

   state  trump_points  hilarry_points
3     AZ            11               0
10    FL            29               0
16    IA             6               0
34    NC            15               0
36    OH            18               0
39    PA            20               0
41    SC             9               0
50    WI            10               0

In [14]:
trump_total = df[df.trump_points > 0].trump_points.sum()
trump_total

118

In [15]:
df[df.hilarry_points > 0]

   state  trump_points  hilarry_points
5     CA             0              55
6     CO             0               9
21    MD             0              10
29    NV             0               6
30    NH             0               4
33    NY             0              29
47    VA             0              13

In [16]:
hillary_total = df[df.hilarry_points > 0].hilarry_points.sum()
hillary_total

126